Repository: Double-q1015/blog_open
Catalog: 编程器提取固件/CH341A_Pro编程器资料包（创客电子元件）-04/CH341A Pro编程器资料包/AsProgrammer_2.0.3a编程器/lang/*.po
Languages: fr, it, ja, pl, pt_br

source: Установлен размер страницы кратный двум!
fr: La taille de la page est définie sur un multiple de deux!
it: La dimensione della pagina è impostata su un multiplo di due!
ja: ページサイズは2の倍数に設定されています
pl: Rozmiar strony jest ustawiony na wielokrotność dwóch!
pt_br: O tamanho da página é uma potência de 2!

source: Установлен стандартный размер страницы
fr: La taille de page par défaut est définie.
it: La dimensione della pagina predefinita è impostata.
ja: ページサイズはデフォルトに設定されています
pl: Domyślny rozmiar strony jest ustawiony
pt_br: O tamanho da página padrão está definido.

source: Возможно включена защита на запись. Нажмите кнопку "Снять защиту" и сверьтесь с даташитом
fr: Peut-être protection en écriture. Cliquez sur "Supprimer la protection" et vérifiez la fiche technique.
it: Forse protetta da scrittura. Fai clic su "Elimina protezione" e controlla la scheda tecnica.
ja: おそらく書き込み保護が有効です「保護解除」を押してデータシートを確認してください
pl: Prawdopodobnie ochrona przed zapisem. Kliknij przycisk „Usuń ochronę” i sprawdź notę katalogowa.

source: Изменен
fr: Changé
it: Cambiato
ja: 変更
pl: Zmodyfikowany
pt_br: Modificado

source: Проверьте настройки
fr: Vérifier les paramètres
it: Controlla le impostazioni
ja: 設定を確認してください
pl: Sprawdź ustawienia
pt_br: Verificar configurações

source: Чип будет стерт и перезаписан. Продолжить?
fr: La puce sera effacée et écrasée. Continuer?
it: Il chip verrà cancellato e sovrascritto. Continuare?
ja: ICは消去され、書き込まれます。継続しますか?
pl: Układ zostanie wyczyszczony i zaprogramowany. Kontynuować?
pt_br: O Chip será apagado e programado. Continuar?

source: Ошибка подключения к USBAsp
it: Errore durante la connessione a USBAsp
ja: エラー USBAspを接続できません
pl: Błąd połączenia z USBAsp
pt_br: Erro ao conectar o USBAsp

source: Ошибка подключения к CH341
it: Errore durante la connessione a CH341A
ja: エラー CH341を接続できません
pl: Błąd połączenia z CH341
pt_br: Erro ao conectar o CH341

source: Ошибка подключения к AVRISP
it: Errore durante la connessione a AVRISP
ja: エラー AVRISPを接続できません
pl: Błąd połączenia z AVRISP
pt_br: Erro ao conectar o AVRISP

source: Готово
fr: Fait
it: Fatto
ja: 完了
pl: Gotowe
pt_br: Pronto

source: Стираю флэшку...
fr: Effacement...
it: Cancella l'unità flash...
ja: メモリを消去中...
pl: Wymazywanie pamięci...
pt_br: Apagando a memória

source: Перейти по адресу
fr: Aller à l'addresse
it: Vai all'indirizzo
ja: アドレスに移動
pl: Idź do adresu
pt_br: Ir para o endereço

source: Микросхема не отвечает
fr: La puce ne répond pas
it: Il chip non risponde
ja: IC が応答しません
pl: Układ nie odpowiada
pt_br: Chip não responde

source: (Неизвестно)
fr: (ID Iconnu)
it: (ID sconosciuto)
ja: (不明)
pl: (Nieznany)
pt_br: (Desconhecido)

source: Данная версия прошивки не поддерживает I2C и MW!
fr: Ce firmware ne supporte pas I2C et 93Cxx!
it: Questo firmware non supporta I2C e 93Cxx!
ja: このファームウェアはI2CとMWをサポートしていません!
pl: Ta wersja oprogramowania nie obsługuje I2C i MW!
pt_br: Este firmware não suporta I2C e MW!

source: Стало Sreg:
fr: Nouveau SREG:
it: Nuovo SREG:
ja: 新しい状態レジスタ:
pl: Nowy SREG:
pt_br: Novo SREG:

source: Используется программатор:
fr: Programmeur actuel:
it: Programmatore attuale:
ja: 現在のプログラマ(ハードウェア):
pl: Używany programator:
pt_br: Programador atual:

source: Значение не найдено
fr: Valeur non trouvée
it: Valore non trovato
ja: 値がみつかりません
pl: Nie znaleziono wartości
pt_br: Valor não encontrado

source: Данная версия прошивки не поддерживается!
fr: Ce firmware n'est pas supporté!
it: Questo firmware non è supportato!
ja: このファームウェアはメモリへの書き込みをサポートしていません
pl: Ta wersja oprogramowania nie obsługuje programowania pamięci!
pt_br: Este firmware não suporta programação de memória

source: Было Sreg:
fr: Ancien SREG:
it: Vecchio SREG:
ja: 古い状態レジスタ:
pl: Stary SREG:
pt_br: Antigo SREG:

source: Читаю флэшку...
fr: Lecture memoire...
it: Lettura memoria...
ja: メモリ読み取り中...
pl: Odczytywanie pamięci...
pt_br: Lendo a memória

source: Поиск HEX значения
fr: Recherche valeur HEX
it: Ricerca valore HEX
ja: 16進数で検索
pl: Szukaj wartości HEX
pt_br: Pesquisar valor HEX

source: Ошибка установки скорости SPI
fr: Erreur de réglage de la vitesse SPI
it: Errore di regolazione della velocità SPI
ja: SPI周波数クロックの設定エラー
pl: Błąd podczas ustawiania prędkości SPI
pt_br: Erro ao definir a velocidade do SPI

source: Размер:
fr: Taille:
it: Formato:
ja: サイズ:
pl: Rozmiar:
pt_br: Tamanho:

source: Укажите шестнадцатеричные числа
fr: Spécifiez les nombres hexadécimaux
it: Specificare i numeri esadecimali
ja: Use HEX numbers
pl: Podaj liczby szesnastkowe
pt_br: Use números HEX

source: Точно стереть чип?
fr: Effacement IC?
it: Cancella IC?
ja: IC を消去しますか?
pl: Czy wymazać chip dokładnie?
pt_br: Apagar Chip?

source: Начать запись?
fr: Commencer programation?
it: Inizio a programmare?
ja: Begin programming?
pl: Rozpocząć wgrywanie?
pt_br: Começar a programar?

source: Время выполнения:
fr: Délai d'exécution:
it: Tempo di esecuzione:
ja: 実行時間:
pl: Czas wykonania:
pt_br: Tempo de execução:

source: USB_control_msg отвалился по таймауту!
fr: USB_control_msg est tombé en fin de timeout!
it: USB_control_msg è scaduto il timeout!
ja: USB_control_msg タイムアウト!
pl: USB_control_msg upłynął limit czasu !
pt_br: Tempo limite do USB_control_msg!

source: Прервано пользователем
fr: Interrompu par l'utilisateur
it: Interrotto dall'utente
ja: ユーザーによってキャンセル
pl: Przerwany przez użytkownika
pt_br: Cancelado pelo usuário

source: Проверяю флэшку...
fr: Verification memoire...
it: Verifica della memoria...
ja: メモリを検証中...
pl: Sprawdzanie pamięci...
pt_br: Verificar a memória

source: Ошибка сравнения по адресу:
fr: Erreur de comparaison à:
it: Errore di confronto a:
ja: アドレスの検証エラー:
pl: Błąd weryfikacja na adresie:
pt_br: Erro de verificação no endereço:

source: Записываю флэшку...
fr: Ecriture memoire...
it: Scrittura memoria...
ja: メモリに書き込み中...
pl: Zapisuje do pamięci...
pt_br: Programando a memória

source: Записываю флэшку с проверкой...
fr: Ecriture memoire(verification)...
it: Scrittura memoria(verifica)...
ja: メモリに書き込み中(検証)...
pl: Zapisuje do pamięci oraz sprawdzam...
pt_br: Memória de programação (verificação)...

source: Количество прочитанных байт не равно размеру флэшки
fr: Le nombre d'octets lus n'est pas égal à la taille de la puce
it: Il numero di byte letti non è uguale alla dimensione IC
ja: 読み取ったバイト数がICのサイズと一致しません
pl: Liczba odczytanych bajtów nie jest równa rozmiarowi pamięci
pt_br: Número de bytes lidos é diferente do tamanho do Chip

source: Количество записанных байт не равно размеру флэшки
fr: Le nombre d'octets écrits n'est pas égal à la taille de la puce
it: Il numero di byte scritti non è uguale alla dimensione IC
ja: 書き込んだバイト数がICのサイズと一致しません
pl: Liczba zapisanych bajtów nie jest równa rozmiarowi pamięci
pt_br: Número de bytes gravados é diferente do tamanho do Chip

source: Размер файла больше размера чипа
fr: Taille de fichier supérieure à la taille de la puce
it: Dimensione del file maggiore della dimensione del chip
ja: ファイルサイズがICのサイズより大きいです
pl: Rozmiar pliku większy niż rozmiar chipa
pt_br: Tamanho do arquivo maior que o tamanho do Chip

source: Программатор
fr: Hardware
it: Hardware
ja: ハードウェア
pl: Programator
pt_br: Selecione o Programador

source: Снять защиту
fr: Supprimer la protection
it: Rimuovere la protezione
ja: 保護解除
pl: Usuń ochronę
pt_br: Desproteger

source: Прервать текущею операцию
fr: Abandonner
it: Abbandonare
ja: キャンセル
pl: Przerwij bieżącą operację
pt_br: Cancelar

source: Стереть
fr: Effacement IC
it: Cancellazione IC
ja: IC 消去
pl: Wymaż
pt_br: Apagar

source: Загрузить прошивку в редактор
fr: Ouvrir
it: Aprire
ja: ファイルを開く
pl: Otwórz plik
pt_br: Abrir arquivo

source: Прочитать
fr: Lecture IC
it: Lettura IC
ja: IC 読込
pl: Odczytaj
pt_br: Ler

source: Прочитать индификатор
fr: Lecture ID
it: Lettura ID
ja: IC 識別
pl: Odczytaj identyfikator
pt_br: ID de leitura

source: Сохранить прошивку из редактора
fr: Sauver
it: Salva il firmware dall'editor
ja: ファイルに保存
pl: Zapisz plik
pt_br: Salvar arquivo

source: Сравнить содержимое
fr: Verification IC
it: Verifica IC
ja: IC 検証
pl: Porównaj zawartość
pt_br: Verificar

source: Записать
fr: Programmer IC
it: Pogramma IC
ja: IC 書込
pl: Wgraj
pt_br: Programar

source: Очистить
fr: Effacer
it: Cancellare
ja: クリア
pl: Oczyść
pt_br: Limpar

source: Тип адресации к памяти
fr: Type d'adressage mémoire
it: Tipo di indirizzamento della memoria
ja: Type of addressing
pl: Rodzaj adresowania pamięci
pt_br: Tipo de endereço

source: Размер чипа в байтах
fr: Taille IC en bytes
it: Dimensione IC in byte
ja: IC size in bytes
pl: Rozmiar chipa w bajtach
pt_br: Tamanho do Chip em bytes

source: Chip size
ja: チップサイズ

source: Снять защиту -> стереть -> записать -> проверить
fr: Supprimer la protection -> Effacer -> Ecrire -> Vérifier
it: Elimina protezione -> Cancella -> Scrivi -> Verifica
ja: 保護解除 -> 消去 -> 書き込み -> 検証
pl: Usuń ochronę -> wymaż-> zaprogramuj -> sprawdź
pt_br: Desproteger -> apagar -> programar -> verificar

source: Длинна адреса в битах
fr: Longueur d'adresse en bits
it: Lunghezza dell'indirizzo bit
ja: アドレスの長さ (ビット単位)
pl: Długość adresu w bitach
pt_br: Comprimento do endereço em bits

source: Размер страницы
fr: Taille de la page
it: Dimensione della pagina
ja: ページサイズ
pl: Rozmiar strony
pt_br: Tamanho

source: Page size
ja: ページサイズ

# TMAINFORM.COPYLOGMENUITEM.CAPTION
source: Копировать
fr: Copie
it: Copia
ja: コピー
pl: Kopiuj
pt_br: Copiar

source: Страница
fr: Page
it: Pagina
ja: ページ
pl: Strona
pt_br: Página

source: Размер
fr: Taille
it: Formato
ja: サイズ
pl: Rozmiar
pt_br: Tamanho

source: Тип адреса
fr: Type d'adresse
it: Tipo di indirizzo
ja: アドレスタイプ
pl: Rodzaj adresu
pt_br: Tipo Endereço

source: Длина адреса
fr: Longueur adresse
it: Lunghezza dell'indirizzo
ja: アドレス長さ
pl: Długość adresu
pt_br: Comprimento do endereço

# tmainform.label3.caption
source: Микросхема:
fr: IC:
it: IC:
ja: IC:
pl: Chip:
pt_br: Chip selecionado:

source: Команды SPI
fr: SPI commandes
it: SPI comandi
ja: SPI コマンド
pl: Komendy SPI
pt_br: Código SPI

source: Проверка записи
fr: Verification
it: Verifica
ja: 検証
pl: Sprawdź po zapisie
pt_br: Verificar

# TMAINFORM.MENUCHIP.CAPTION
source: Микросхема
fr: IC
it: IC
ja: IC
pl: Chip
pt_br: Seleção do Chip

# tmainform.menucopytoclip.caption
source: Копировать
fr: Copie
it: Copia
ja: コピー
pl: Kopiuj
pt_br: Copiar

source: Поиск
fr: Recherche
it: Ricerca
ja: 検索
pl: Szukaj
pt_br: Buscar

source: Разрешить режим вставки
fr: Mode insertion
ja: 挿入モードを許可する

# tmainform.menufindchip.caption
source: Поиск
fr: Recherche
it: Ricerca
ja: 検索
pl: Szukaj
pt_br: Pesquisar

source: Не проверять Busy бит
fr: Ne pas vérifier le Busy bit
it: Non controllare il Busy bit
ja: Busy bitを検証しない
pl: Nie sprawdzaj bitu Busy
pt_br: Não verificar bits ocupados

source: Поставить защиту
fr: Mettre la protection
it: Metti la protezione
ja: 保護ビットを設定する
pl: Ustaw ochronę
pt_br: Definir os bits de proteção

source: Прочитать SREG
fr: Lecture SREG
it: Lettura SREG
ja: 状態レジスタを読込
pl: Odczytaj SREG
pt_br: Ler SREG

source: Изменить SREG
fr: Edition SREG
it: Edizione SREG
ja: 状態レジスタを編集
pl: Edytuj SREG
pt_br: Editar SREG

# TMAINFORM.MENUMWCLOCK.CAPTION
source: Частота
fr: Frequence
it: Frequenza
ja: クロック周波数
pl: Częstotliwość
pt_br: Frequência

source: Настройки
fr: Options
it: Opzioni
ja: オプション
pl: Opcje
pt_br: Opções

# tmainform.menuspiclock.caption
source: Частота
fr: Frequence
it: Frequenza
ja: クロック周波数
pl: Częstotliwość
pt_br: Frequência

source: Учитывать регистр
fr: Sensible à la case
it: Sensible à la case
ja: 大文字小文字を区別
pl: Wielkość liter ma znaczenie
pt_br: Sensibilidade a maiúsculas e minúsculas

source: Найти
fr: Trouver
it: Trovare
ja: 検索
pl: Znajdź
pt_br: Encontrar

source: Искать сначала
fr: Du début
it: Cerca prima
ja: 最初から検索
pl: Od początku
pt_br: Do começo

source: Искать HEX значение
fr: Recherche valeur HEX
it: Ricerca valore HEX
ja: Search HEX value
pl: Wyszukaj wartość HEX
pt_br: Pesquisar valor HEX

source: Заменить все
fr: Remplacer tout
it: Sostituisci tutto
ja: すべて置換
pl: Zamień wszytko
pt_br: Substituir tudo

source: Заменить
fr: Replacer
it: Replacer
ja: 置換
pl: Zamień
pt_br: Substituir

source: заменить на:
fr: remplacer par:
it: sostituire con:
ja: 次に置換:
pl: zamień na:
pt_br: Substituir para:

source: Искать
fr: Trouver
it: Trovare
ja: 検索
pl: Znajdź
pt_br: Encontrar

# TSREGEDITFORM.BUTTONREADSREG.CAPTION
source: Прочитать
fr: Lire
it: Leggere
ja: 読み取り
pl: Odczytaj
pt_br: Ler

# TSREGEDITFORM.BUTTONWRITESREG.CAPTION
source: Записать
fr: Ecrire
it: Scrivi
ja: 書き込み
pl: Zapisz
pt_br: Escrever

source: Поиск микросхемы
fr: Recherche IC
it: Ricerca IC
ja: IC を検索
pl: Znajdź chip
pt_br: Pesquisar

source: Маркировка содержит:
fr: Le marquage contient:
it: La marcatura contiene:
ja: IC 検索ワード:
pl: Oznaczenie zawiera:
pt_br: Digite o código do Chip:

source: Проверка на чистоту
fr: Vérification effacement
it: Verifica cancellatura
ja: ブランクチェック
pl: Sprawdzić pustość
pt_br: Verificar Em Branco

# tmainform.Label_I2C_DevAddr.caption
source: Адрес устройства
fr: Adresse de l'appareil
it: Indirizzo del dispositivo
ja: デバイスアドレス
pl: Adres urządzenia
pt_br: Endereço Dispositivo

# tmainform.CheckBox_I2C_ByteRead.caption
source: Побайтовое чтение
fr: Lecture octet
it: Lettura byte
ja: バイト読み取り
pl: Odczytywanie bajtów
pt_br: Ler Byte

source: Скрипты
fr: Scripts
it: Scripts
ja: スクリプト
pl: Skrypty
pt_br: Scripts

source: Нет секции:
fr: Il n'y a pas de section:
it: Non c'è sezione:
ja: セクションではない:
pl: Brak sekcji:
pt_br: Não há seção:

source: Выполняется секция:
fr: Section en cours:
it: Sezione attuale:
ja: 実行中のセクション:
pl: Wykonaj sekcje:
pt_br: Seção de execuções:

source: Выберите секцию
fr: Choisissez une section
it: Scegli una sezione
ja: セクションを指定してください
pl: Wybierz sekcję
pt_br: Selecionar seção

source: файл изменён
fr: Fichier modifié
it: File modificato
ja: ファイルが変更されました
pl: Plik zmodyfikowany
pt_br: Arquivo modificado

source: Сохранить изменения?
fr: Sauvegarder les changements?
it: Salva le modifiche?
ja: 変更を保存しますか?
pl: Zapisać zmiany?
pt_br: Salvar alterações?

source: Используется скрипт:
fr: Script utilisé:
it: Script utilizzato:
ja: 使用中のセクション:
pl: Używany skrypt:
pt_br: Usando script:

source: Файл
fr: Fichier
it: File
ja: ファイル
pl: Plik
pt_br: Arquivo

source: Открыть
fr: Ouvrir
it: Aprire
ja: 開く
pl: Otwórz
pt_br: Abrir

source: Выполнить
fr: Executer
it: Eseguire
ja: 実行
pl: Wykonaj
pt_br: Executar

source: Сохранить
fr: Enregistrer
it: Salva
ja: 保存
pl: Zapisz
pt_br: Salvar

source: Сохранить как...
fr: Enregistrer sous...
it: Salva come...
ja: 名前を付けて保存
pl: Zapisz jako...
pt_br: Salvar como

source: Секция =
fr: Section =
it: Sezione =
ja: セクション =
pl: Sekcja =
pt_br: Seção

source: Ошибка подключения к
fr: Erreur de connexion

source: Процесс может длиться больше минуты на больших флешках!
fr: Le processus peut prendre plus d'une minute sur une mémoire de grande taille!

source: Не писать FF
fr: Ne pas écrire les FF

source: Выбрать микросхему
fr: Selectionner IC

source: Возможно включена защита на запись. Нажмите кнопку "Снять защиту" и сверьтесь с даташитом
pt_br: Possível proteção está ativada. Pressione "Desproteger" e verifique a folha de dados
